ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32630/device/rtc_regs.h
/**
 * @file
 * @brief   Registers, Bit Masks and Bit Positions for the Real-Time Clock.
 *
 */
/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-10-10 19:28:26 -0500 (Mon, 10 Oct 2016) $
 * $Revision: 24670 $
 *
 **************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_RTC_REGS_H_
#define _MXC_RTC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
    If types are not defined elsewhere (CMSIS) define them here
*/
/// @cond
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __RO
#define __RO volatile const
#endif
/// @endcond

/**
 * @ingroup     rtc
 * @defgroup    rtc_registers RTC Registers
 * @brief       Registers, Bit Masks and Bit Positions
 * @{
 */

/**
 * Structure type for the Real-Time Clock module registers allowing direct 32-bit access to each register.
 */
typedef struct {
    __IO uint32_t ctrl;                                 /**< <tt>\b 0x0000: </tt> RTC_CTRL Register - RTC Timer Control                                                          */
    __IO uint32_t timer;                                /**< <tt>\b 0x0004: </tt> RTC_TIMER Register - RTC Timer Count Value                                            */
    __IO uint32_t comp[2];                              /**< <tt>\b 0x0008-0x000C: </tt> RTC_COMP0/RTC_COMP1 Registers - RTC Time of Day Alarm [0..1] Compare Register */
    __IO uint32_t flags;                                /**< <tt>\b 0x0010: </tt> RTC_FLAGS Register - CPU Interrupt and RTC Domain Flags                               */
    __IO uint32_t snz_val;                              /**< <tt>\b 0x0014: </tt> RTC_SNZ_VAL Register - RTC Timer Alarm Snooze Value                                   */
    __IO uint32_t inten;                                /**< <tt>\b 0x0018: </tt> RTC_INTEN Register - Interrupt Enable Controls                                        */
    __IO uint32_t prescale;                             /**< <tt>\b 0x001C: </tt> RTC_PRESCALE Register - RTC Timer Prescale Setting                                    */
    __RO uint32_t rsv020;                               /**< <tt>\b 0x0020: </tt> RESERVED                                                                              */
    __IO uint32_t prescale_mask;                        /**< <tt>\b 0x0024: </tt> RTC_PRESCALE_MASK Register - RTC Timer Prescale Compare Mask                          */
    __IO uint32_t trim_ctrl;                            /**< <tt>\b 0x0028: </tt> RTC_TRIM_CTRL Register - RTC Timer Trim Controls                                      */
    __IO uint32_t trim_value;                           /**< <tt>\b 0x002C: </tt> RTC_TRIM_VALUE Register - RTC Timer Trim Adjustment Interval                          */
} mxc_rtctmr_regs_t;


/**
 * Structure type for access to the RTC CFG hardware.
 */
typedef struct {
    __IO uint32_t nano_cntr;                            /**< <tt>\b 0x0000: </tt> - RTCCFG_NANO_CNTR - Nano Oscillator Counter Read Register    */
    __IO uint32_t clk_ctrl;                             /**< <tt>\b 0x0004: </tt> - RTCCFG_CLK_CTRL - RTC Clock Control Settings                */
    __RO uint32_t rsv008;                               /**< <tt>\b 0x0008: </tt> - RESERVED                                                    */
    __IO uint32_t osc_ctrl;                             /**< <tt>\b 0x000C: </tt> - RTCCFG_OSC_CTRL - RTC Oscillator Control                    */
} mxc_rtccfg_regs_t;
/**@} end of group rtc_registers.*/

/*
   Register offsets for module RTC.
*/
/**
 * @ingroup    rtc_registers
 * @defgroup   RTC_Register_Offsets Register Offsets
 * @brief      Real-Time Clock Register Offsets from the RTC Base Peripheral Address.
 * @{
 */
#define MXC_R_RTCTMR_OFFS_CTRL                              ((uint32_t)0x00000000UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0000</tt> */
#define MXC_R_RTCTMR_OFFS_TIMER                             ((uint32_t)0x00000004UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0004</tt> */
#define MXC_R_RTCTMR_OFFS_COMP0                             ((uint32_t)0x00000008UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0008</tt> */
#define MXC_R_RTCTMR_OFFS_COMP1                             ((uint32_t)0x0000000CUL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x000C</tt> */
#define MXC_R_RTCTMR_OFFS_FLAGS                             ((uint32_t)0x00000010UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0010</tt> */
#define MXC_R_RTCTMR_OFFS_SNZ_VAL                           ((uint32_t)0x00000014UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0014</tt> */
#define MXC_R_RTCTMR_OFFS_INTEN                             ((uint32_t)0x00000018UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0018</tt> */
#define MXC_R_RTCTMR_OFFS_PRESCALE                          ((uint32_t)0x0000001CUL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x001C</tt> */
#define MXC_R_RTCTMR_OFFS_PRESCALE_MASK                     ((uint32_t)0x00000024UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0024</tt> */
#define MXC_R_RTCTMR_OFFS_TRIM_CTRL                         ((uint32_t)0x00000028UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0028</tt> */
#define MXC_R_RTCTMR_OFFS_TRIM_VALUE                        ((uint32_t)0x0000002CUL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x002C</tt> */
/**@} end of group RTC_Register_Offsets */
/**
 * @ingroup    rtc_registers
 * @defgroup   RTCCFG_Register_Offsets RTCCFG Register Offsets
 * @brief      Real-Time Clock CFG Register Offsets from the RTCCFG Base Peripheral Address.
 * @{
 */
#define MXC_R_RTCCFG_OFFS_NANO_CNTR                         ((uint32_t)0x00000000UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0000</tt> */
#define MXC_R_RTCCFG_OFFS_CLK_CTRL                          ((uint32_t)0x00000004UL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x0004</tt> */
#define MXC_R_RTCCFG_OFFS_OSC_CTRL                          ((uint32_t)0x0000000CUL)    /**< Offset from the RTC Base Peripheral Address:<tt>\b 0x000C</tt> */
/**@} end of group RTCCFG_Register_Offsets */

