ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32630/device/rtc_regs.h
/*
   Field positions and masks for module RTC.
*/
/**
 * @ingroup rtc_registers
 * @defgroup RTC_CTRL_Register RTC_CTRL
 * @{
 */
#define MXC_F_RTC_CTRL_ENABLE_POS                           0                                                                           /**< ENABLE Position */
#define MXC_F_RTC_CTRL_ENABLE                               ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_ENABLE_POS))                     /**< ENABLE Mask */
#define MXC_F_RTC_CTRL_CLEAR_POS                            1                                                                           /**< CLEAR Position */
#define MXC_F_RTC_CTRL_CLEAR                                ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_CLEAR_POS))                      /**< CLEAR Mask */
#define MXC_F_RTC_CTRL_PENDING_POS                          2                                                                           /**< PENDING Position */
#define MXC_F_RTC_CTRL_PENDING                              ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_PENDING_POS))                    /**< PENDING Mask */
#define MXC_F_RTC_CTRL_USE_ASYNC_FLAGS_POS                  3                                                                           /**< USE_ASYNC_FLAGS Position */
#define MXC_F_RTC_CTRL_USE_ASYNC_FLAGS                      ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_USE_ASYNC_FLAGS_POS))            /**< USE_ASYNC_FLAGS Mask */
#define MXC_F_RTC_CTRL_AGGRESSIVE_RST_POS                   4                                                                           /**< AGGRESSIVE_RST Position */
#define MXC_F_RTC_CTRL_AGGRESSIVE_RST                       ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_AGGRESSIVE_RST_POS))             /**< AGGRESSIVE_RST Mask */
#define MXC_F_RTC_CTRL_AUTO_UPDATE_DISABLE_POS              5                                                                           /**< AUTO_UPDATE_DISABLE Position */
#define MXC_F_RTC_CTRL_AUTO_UPDATE_DISABLE                  ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_AUTO_UPDATE_DISABLE_POS))        /**< AUTO_UPDATE_DISABLE Mask */
#define MXC_F_RTC_CTRL_SNOOZE_ENABLE_POS                    6                                                                           /**< SNOOZE_ENABLE Position */
#define MXC_F_RTC_CTRL_SNOOZE_ENABLE                        ((uint32_t)(0x00000003UL << MXC_F_RTC_CTRL_SNOOZE_ENABLE_POS))              /**< SNOOZE_ENABLE Mask */
#define MXC_F_RTC_CTRL_RTC_ENABLE_ACTIVE_POS                16                                                                          /**< RTC_ENABLE_ACTIVE Position */
#define MXC_F_RTC_CTRL_RTC_ENABLE_ACTIVE                    ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_RTC_ENABLE_ACTIVE_POS))          /**< RTC_ENABLE_ACTIVE Mask */
#define MXC_F_RTC_CTRL_OSC_GOTO_LOW_ACTIVE_POS              17                                                                          /**< OSC_GOTO_LOW_ACTIVE Position */
#define MXC_F_RTC_CTRL_OSC_GOTO_LOW_ACTIVE                  ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_OSC_GOTO_LOW_ACTIVE_POS))        /**< OSC_GOTO_LOW_ACTIVE Mask */
#define MXC_F_RTC_CTRL_OSC_FRCE_SM_EN_ACTIVE_POS            18                                                                          /**< OSC_FRCE_SM_EN_ACTIVE Position */
#define MXC_F_RTC_CTRL_OSC_FRCE_SM_EN_ACTIVE                ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_OSC_FRCE_SM_EN_ACTIVE_POS))      /**< OSC_FRCE_SM_EN_ACTIVE Mask */
#define MXC_F_RTC_CTRL_OSC_FRCE_ST_ACTIVE_POS               19                                                                          /**< OSC_FRCE_ST_ACTIVE  Position */
#define MXC_F_RTC_CTRL_OSC_FRCE_ST_ACTIVE                   ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_OSC_FRCE_ST_ACTIVE_POS))         /**< OSC_FRCE_ST_ACTIVE Mask */
#define MXC_F_RTC_CTRL_RTC_SET_ACTIVE_POS                   20                                                                          /**< RTC_SET_ACTIVE Position */
#define MXC_F_RTC_CTRL_RTC_SET_ACTIVE                       ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_RTC_SET_ACTIVE_POS))             /**< RTC_SET_ACTIVE Mask */
#define MXC_F_RTC_CTRL_RTC_CLR_ACTIVE_POS                   21                                                                          /**< RTC_CLR_ACTIVE Position */
#define MXC_F_RTC_CTRL_RTC_CLR_ACTIVE                       ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_RTC_CLR_ACTIVE_POS))             /**< RTC_CLR_ACTIVE Mask */
#define MXC_F_RTC_CTRL_ROLLOVER_CLR_ACTIVE_POS              22                                                                          /**< ROLLOVER_CLR_ACTIVE Position */
#define MXC_F_RTC_CTRL_ROLLOVER_CLR_ACTIVE                  ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_ROLLOVER_CLR_ACTIVE_POS))        /**< ROLLOVER_CLR_ACTIVE Mask */
#define MXC_F_RTC_CTRL_PRESCALE_CMPR0_ACTIVE_POS            23                                                                          /**< PRESCALE_CMPR0_ACTIVE Position */
#define MXC_F_RTC_CTRL_PRESCALE_CMPR0_ACTIVE                ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_PRESCALE_CMPR0_ACTIVE_POS))      /**< PRESCALE_CMPR0_ACTIVE Mask */
#define MXC_F_RTC_CTRL_PRESCALE_UPDATE_ACTIVE_POS           24                                                                          /**< PRESCALE_UPDATE_ACTIVE Position */
#define MXC_F_RTC_CTRL_PRESCALE_UPDATE_ACTIVE               ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_PRESCALE_UPDATE_ACTIVE_POS))     /**< PRESCALE_UPDATE_ACTIVE Mask */
#define MXC_F_RTC_CTRL_CMPR1_CLR_ACTIVE_POS                 25                                                                          /**< CMPR1_CLR_ACTIVE Position */
#define MXC_F_RTC_CTRL_CMPR1_CLR_ACTIVE                     ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_CMPR1_CLR_ACTIVE_POS))           /**< CMPR1_CLR_ACTIVE Mask */
#define MXC_F_RTC_CTRL_CMPR0_CLR_ACTIVE_POS                 26                                                                          /**< CMPR0_CLR_ACTIVE Position */
#define MXC_F_RTC_CTRL_CMPR0_CLR_ACTIVE                     ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_CMPR0_CLR_ACTIVE_POS))           /**< CMPR0_CLR_ACTIVE Mask */
#define MXC_F_RTC_CTRL_TRIM_ENABLE_ACTIVE_POS               27                                                                          /**< TRIM_ENABLE_ACTIVE Position */
#define MXC_F_RTC_CTRL_TRIM_ENABLE_ACTIVE                   ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_TRIM_ENABLE_ACTIVE_POS))         /**< TRIM_ENABLE_ACTIVE Mask */
#define MXC_F_RTC_CTRL_TRIM_SLOWER_ACTIVE_POS               28                                                                          /**< TRIM_SLOWER_ACTIVE  Position */
#define MXC_F_RTC_CTRL_TRIM_SLOWER_ACTIVE                   ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_TRIM_SLOWER_ACTIVE_POS))         /**< TRIM_SLOWER_ACTIVE Mask */
#define MXC_F_RTC_CTRL_TRIM_CLR_ACTIVE_POS                  29                                                                          /**< TRIM_CLR_ACTIVE Position */
#define MXC_F_RTC_CTRL_TRIM_CLR_ACTIVE                      ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_TRIM_CLR_ACTIVE_POS))            /**< TRIM_CLR_ACTIVE Mask */
#define MXC_F_RTC_CTRL_ACTIVE_TRANS_0_POS                   30                                                                          /**< ACTIVE_TRANS_0 Position */
#define MXC_F_RTC_CTRL_ACTIVE_TRANS_0                       ((uint32_t)(0x00000001UL << MXC_F_RTC_CTRL_ACTIVE_TRANS_0_POS))             /**< ACTIVE_TRANS_0 Mask */
/**@} end of group RTC_CTRL*/
/**
 * @ingroup rtc_registers
 * @defgroup RTC_FLAGS_Register RTC_FLAGS
 * @{
 */
#define MXC_F_RTC_FLAGS_COMP0_POS                           0                                                                           /**< COMP0 Position */
#define MXC_F_RTC_FLAGS_COMP0                               ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_COMP0_POS))                     /**< COMP0 Mask */
#define MXC_F_RTC_FLAGS_COMP1_POS                           1                                                                           /**< COMP1 Position */
#define MXC_F_RTC_FLAGS_COMP1                               ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_COMP1_POS))                     /**< COMP1 Mask */
#define MXC_F_RTC_FLAGS_PRESCALE_COMP_POS                   2                                                                           /**< PRESCALE_COMP Position */
#define MXC_F_RTC_FLAGS_PRESCALE_COMP                       ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_PRESCALE_COMP_POS))             /**< PRESCALE_COMP Mask */
#define MXC_F_RTC_FLAGS_OVERFLOW_POS                        3                                                                           /**< OVERFLOW Position */
#define MXC_F_RTC_FLAGS_OVERFLOW                            ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_OVERFLOW_POS))                  /**< OVERFLOW Mask */
#define MXC_F_RTC_FLAGS_TRIM_POS                            4                                                                           /**< TRIM Position */
#define MXC_F_RTC_FLAGS_TRIM                                ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_TRIM_POS))                      /**< TRIM Mask */
#define MXC_F_RTC_FLAGS_SNOOZE_POS                          5                                                                           /**< SNOOZE Position */
#define MXC_F_RTC_FLAGS_SNOOZE                              ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_SNOOZE_POS))                    /**< SNOOZE Mask */
#define MXC_F_RTC_FLAGS_COMP0_FLAG_A_POS                    8                                                                           /**< COMP0_FLAG_A Position */
#define MXC_F_RTC_FLAGS_COMP0_FLAG_A                        ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_COMP0_FLAG_A_POS))              /**< COMP0_FLAG_A Mask */
#define MXC_F_RTC_FLAGS_COMP1_FLAG_A_POS                    9                                                                           /**< COMP1_FLAG_A Position */
#define MXC_F_RTC_FLAGS_COMP1_FLAG_A                        ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_COMP1_FLAG_A_POS))              /**< COMP1_FLAG_A Mask */
#define MXC_F_RTC_FLAGS_PRESCL_FLAG_A_POS                   10                                                                          /**< PRESCL_FLAG_A Position */
#define MXC_F_RTC_FLAGS_PRESCL_FLAG_A                       ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_PRESCL_FLAG_A_POS))             /**< PRESCL_FLAG_A Mask */
#define MXC_F_RTC_FLAGS_OVERFLOW_FLAG_A_POS                 11                                                                          /**< OVERFLOW_FLAG_A Position */
#define MXC_F_RTC_FLAGS_OVERFLOW_FLAG_A                     ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_OVERFLOW_FLAG_A_POS))           /**< OVERFLOW_FLAG_A Mask */
#define MXC_F_RTC_FLAGS_TRIM_FLAG_A_POS                     12                                                                          /**< TRIM_FLAG_A Position */
#define MXC_F_RTC_FLAGS_TRIM_FLAG_A                         ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_TRIM_FLAG_A_POS))               /**< TRIM_FLAG_A Mask */
#define MXC_F_RTC_FLAGS_SNOOZE_A_POS                        28                                                                          /**< SNOOZE_A Position */
#define MXC_F_RTC_FLAGS_SNOOZE_A                            ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_SNOOZE_A_POS))                  /**< SNOOZE_A Mask */
#define MXC_F_RTC_FLAGS_SNOOZE_B_POS                        29                                                                          /**< SNOOZE_B Position */
#define MXC_F_RTC_FLAGS_SNOOZE_B                            ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_SNOOZE_B_POS))                  /**< SNOOZE_B Mask */
#define MXC_F_RTC_FLAGS_ASYNC_CLR_FLAGS_POS                 31                                                                          /**< ASYNC_CLR_FLAGS Position */
#define MXC_F_RTC_FLAGS_ASYNC_CLR_FLAGS                     ((uint32_t)(0x00000001UL << MXC_F_RTC_FLAGS_ASYNC_CLR_FLAGS_POS))           /**< ASYNC_CLR_FLAGS Mask */
/**@} end of group RTC_FLAGS_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_SNZ_VAL_Register RTC_SNZ_VAL.
 * @{
 */
#define MXC_F_RTC_SNZ_VAL_VALUE_POS                         0                                                                           /**< VALUE Position */
#define MXC_F_RTC_SNZ_VAL_VALUE                             ((uint32_t)(0x000003FFUL << MXC_F_RTC_SNZ_VAL_VALUE_POS))                   /**< VALUE Mask */
/**@} end of group RTC_SNZ_VAL_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_INTEN_Register RTC_INTEN.
 * @{
 */
#define MXC_F_RTC_INTEN_COMP0_POS                           0                                                                           /**< COMP0 Position */
#define MXC_F_RTC_INTEN_COMP0                               ((uint32_t)(0x00000001UL << MXC_F_RTC_INTEN_COMP0_POS))                     /**< COMP0 Mask */
#define MXC_F_RTC_INTEN_COMP1_POS                           1                                                                           /**< COMP1 Position */
#define MXC_F_RTC_INTEN_COMP1                               ((uint32_t)(0x00000001UL << MXC_F_RTC_INTEN_COMP1_POS))                     /**< COMP1 Mask */
#define MXC_F_RTC_INTEN_PRESCALE_COMP_POS                   2                                                                           /**< PRESCALE_COMP Position */
#define MXC_F_RTC_INTEN_PRESCALE_COMP                       ((uint32_t)(0x00000001UL << MXC_F_RTC_INTEN_PRESCALE_COMP_POS))             /**< PRESCALE_COMP Mask */
#define MXC_F_RTC_INTEN_OVERFLOW_POS                        3                                                                           /**< OVERFLOW Position */
#define MXC_F_RTC_INTEN_OVERFLOW                            ((uint32_t)(0x00000001UL << MXC_F_RTC_INTEN_OVERFLOW_POS))                  /**< OVERFLOW Mask */
#define MXC_F_RTC_INTEN_TRIM_POS                            4                                                                           /**< TRIM Position */
#define MXC_F_RTC_INTEN_TRIM                                ((uint32_t)(0x00000001UL << MXC_F_RTC_INTEN_TRIM_POS))                      /**< TRIM Mask */
/**@} end of group RTC_INTEN_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_PRESCALE_Register RTC_PRESCALE.
 * @{
 */
#define MXC_F_RTC_PRESCALE_PRESCALE_POS                     0                                                                           /**< PRESCALE Position */
#define MXC_F_RTC_PRESCALE_PRESCALE                         ((uint32_t)(0x0000000FUL << MXC_F_RTC_PRESCALE_PRESCALE_POS))               /**< PRESCALE Mask */
/**@} end of group RTC_INTEN_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_PRESCALE_MASK_Register RTC_PRESCALE_MASK.
 * @{
 */
#define MXC_F_RTC_PRESCALE_MASK_PRESCALE_MASK_POS           0                                                                           /**< PRESCALE_MASK Position */
#define MXC_F_RTC_PRESCALE_MASK_PRESCALE_MASK               ((uint32_t)(0x0000000FUL << MXC_F_RTC_PRESCALE_MASK_PRESCALE_MASK_POS))     /**< PRESCALE_MASK Mask */
/**@} end of group RTC_PRESCALE_MASK_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_TRIM_CTRL_Register RTC_TRIM_CTRL.
 * @{
 */
#define MXC_F_RTC_TRIM_CTRL_TRIM_ENABLE_R_POS               0                                                                           /**< TRIM_ENABLE_R Position */
#define MXC_F_RTC_TRIM_CTRL_TRIM_ENABLE_R                   ((uint32_t)(0x00000001UL << MXC_F_RTC_TRIM_CTRL_TRIM_ENABLE_R_POS))         /**< TRIM_ENABLE_R Mask */
#define MXC_F_RTC_TRIM_CTRL_TRIM_FASTER_OVR_R_POS           1                                                                           /**< TRIM_FASTER_OVR_R Position */
#define MXC_F_RTC_TRIM_CTRL_TRIM_FASTER_OVR_R               ((uint32_t)(0x00000001UL << MXC_F_RTC_TRIM_CTRL_TRIM_FASTER_OVR_R_POS))     /**< TRIM_FASTER_OVR_R Mask */
#define MXC_F_RTC_TRIM_CTRL_TRIM_SLOWER_R_POS               2                                                                           /**< TRIM_SLOWER_R Position */
#define MXC_F_RTC_TRIM_CTRL_TRIM_SLOWER_R                   ((uint32_t)(0x00000001UL << MXC_F_RTC_TRIM_CTRL_TRIM_SLOWER_R_POS))         /**< TRIM_SLOWER_R Mask */
/**@} end of group RTC_TRIM_CTRL_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_TRIM_VALUE_Register RTC_TRIM_VALUE.
 * @{
 */
#define MXC_F_RTC_TRIM_VALUE_TRIM_VALUE_POS                 0                                                                           /**< TRIM_VALUE Position */
#define MXC_F_RTC_TRIM_VALUE_TRIM_VALUE                     ((uint32_t)(0x0003FFFFUL << MXC_F_RTC_TRIM_VALUE_TRIM_VALUE_POS))           /**< TRIM_VALUE Mask */
#define MXC_F_RTC_TRIM_VALUE_TRIM_SLOWER_CONTROL_POS        18                                                                          /**< TRIM_SLOWER_CONTROL Position */
#define MXC_F_RTC_TRIM_VALUE_TRIM_SLOWER_CONTROL            ((uint32_t)(0x00000001UL << MXC_F_RTC_TRIM_VALUE_TRIM_SLOWER_CONTROL_POS))  /**< TRIM_SLOWER_CONTROL Mask */
/**@} end of group RTC_TRIM_VALUE_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_NANO_CNTR_Register RTC_NANO_CNTR.
 * @{
 */
#define MXC_F_RTC_NANO_CNTR_NANORING_COUNTER_POS            0                                                                           /**< NANORING_COUNTER Position */
#define MXC_F_RTC_NANO_CNTR_NANORING_COUNTER                ((uint32_t)(0x0000FFFFUL << MXC_F_RTC_NANO_CNTR_NANORING_COUNTER_POS))      /**< NANORING_COUNTER Mask */
/**@} end of group RTC_NANO_CNTR_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_CLK_CTRL_Register RTC_CLK_CTRL.
 * @{
 */
#define MXC_F_RTC_CLK_CTRL_OSC1_EN_POS                      0                                                                           /**< OSC1_EN Position */
#define MXC_F_RTC_CLK_CTRL_OSC1_EN                          ((uint32_t)(0x00000001UL << MXC_F_RTC_CLK_CTRL_OSC1_EN_POS))                /**< OSC1_EN Mask */
#define MXC_F_RTC_CLK_CTRL_OSC2_EN_POS                      1                                                                           /**< OSC2_EN Position */
#define MXC_F_RTC_CLK_CTRL_OSC2_EN                          ((uint32_t)(0x00000001UL << MXC_F_RTC_CLK_CTRL_OSC2_EN_POS))                /**< OSC2_EN Mask */
#define MXC_F_RTC_CLK_CTRL_NANO_EN_POS                      2                                                                           /**< NANO_EN Position */
#define MXC_F_RTC_CLK_CTRL_NANO_EN                          ((uint32_t)(0x00000001UL << MXC_F_RTC_CLK_CTRL_NANO_EN_POS))                /**< NANO_EN Mask */
/**@} end of group RTC_CLK_CTRL_Register */
/**
 * @ingroup rtc_registers
 * @defgroup RTC_OSC_CTRL_Register RTC_OSC_CTRL.
 * @{
 */
#define MXC_F_RTC_OSC_CTRL_OSC_BYPASS_POS                   0                                                                           /**< OSC_BYPASS  Position */
#define MXC_F_RTC_OSC_CTRL_OSC_BYPASS                       ((uint32_t)(0x00000001UL << MXC_F_RTC_OSC_CTRL_OSC_BYPASS_POS))             /**< OSC_BYPASS Mask */
#define MXC_F_RTC_OSC_CTRL_OSC_DISABLE_R_POS                1                                                                           /**< OSC_DISABLE_R Position */
#define MXC_F_RTC_OSC_CTRL_OSC_DISABLE_R                    ((uint32_t)(0x00000001UL << MXC_F_RTC_OSC_CTRL_OSC_DISABLE_R_POS))          /**< OSC_DISABLE_R Mask */
#define MXC_F_RTC_OSC_CTRL_OSC_DISABLE_SEL_POS              2                                                                           /**< OSC_DISABLE_SEL Position */
#define MXC_F_RTC_OSC_CTRL_OSC_DISABLE_SEL                  ((uint32_t)(0x00000001UL << MXC_F_RTC_OSC_CTRL_OSC_DISABLE_SEL_POS))        /**< OSC_DISABLE_SEL Mask */
#define MXC_F_RTC_OSC_CTRL_OSC_DISABLE_O_POS                3                                                                           /**< OSC_DISABLE_O Position */
#define MXC_F_RTC_OSC_CTRL_OSC_DISABLE_O                    ((uint32_t)(0x00000001UL << MXC_F_RTC_OSC_CTRL_OSC_DISABLE_O_POS))          /**< OSC_DISABLE_O Mask */
#define MXC_F_RTC_OSC_CTRL_OSC_WARMUP_ENABLE_POS            14                                                                          /**< OSC_WARMUP_ENABLE Position */
#define MXC_F_RTC_OSC_CTRL_OSC_WARMUP_ENABLE                ((uint32_t)(0x00000001UL << MXC_F_RTC_OSC_CTRL_OSC_WARMUP_ENABLE_POS))      /**< OSC_WARMUP_ENABLE Mask */
/**@} end of group RTC_OSC_CTRL_Register */

